tests/jmeter/reqmod_stress_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="REQMOD Stress Test">
      <stringProp name="TestPlan.comments">Stress-tests nginx detect_icap REQMOD by POSTing/PUTting every file found in $SAMPLES_FOLDER. Config is read entirely from environment variables (see run_reqmod_stress.sh).</stringProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="Setup - resolve env vars + list SAMPLES_FOLDER">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">stoptestnow</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </SetupThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Resolve env vars + list SAMPLES_FOLDER">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
import java.io.File

def env = System.getenv()
def getenv = { String k, String d -&gt; (env[k] != null &amp;&amp; env[k].trim() != &quot;&quot;) ? env[k] : d }

def samplesFolder = getenv(&quot;SAMPLES_FOLDER&quot;, &quot;&quot;)
if (!samplesFolder) {
    throw new RuntimeException(&quot;SAMPLES_FOLDER env var is not set&quot;)
}
def dir = new File(samplesFolder)
if (!dir.isDirectory()) {
    throw new RuntimeException(&quot;SAMPLES_FOLDER is not a directory: &quot; + samplesFolder)
}
def files = dir.listFiles({ f -&gt; f.isFile() } as FileFilter)
if (files == null || files.length == 0) {
    throw new RuntimeException(&quot;No files found in SAMPLES_FOLDER: &quot; + samplesFolder)
}

// Materialize the file list as a CSV so the main Thread Group can round-robin
// over it via CSVDataSet — this is what makes the &quot;read files from a folder&quot;
// requirement work without a plugin.
def listFile = File.createTempFile(&quot;reqmod_files_&quot;, &quot;.csv&quot;)
listFile.deleteOnExit()
listFile.withWriter(&quot;UTF-8&quot;) { w -&gt;
    files.sort { it.name }.each { f -&gt; w.writeLine(f.getAbsolutePath()) }
}

props.put(&quot;reqmod_file_list&quot;, listFile.getAbsolutePath())
props.put(&quot;reqmod_host&quot;, getenv(&quot;NGINX_HOST&quot;, &quot;localhost&quot;))
props.put(&quot;reqmod_port&quot;, getenv(&quot;NGINX_PORT&quot;, &quot;8080&quot;))
props.put(&quot;reqmod_path&quot;, getenv(&quot;NGINX_PATH&quot;, &quot;/up&quot;))
props.put(&quot;reqmod_threads&quot;, getenv(&quot;JMETER_THREADS&quot;, &quot;1000&quot;))
props.put(&quot;reqmod_rampup&quot;, getenv(&quot;JMETER_RAMPUP&quot;, &quot;5&quot;))
props.put(&quot;reqmod_duration&quot;, getenv(&quot;JMETER_DURATION&quot;, &quot;600&quot;))
props.put(&quot;reqmod_target_rps&quot;, getenv(&quot;JMETER_TARGET_RPS&quot;, &quot;3&quot;))
props.put(&quot;reqmod_results_file&quot;, getenv(&quot;RESULTS_FILE&quot;, &quot;reqmod_results.csv&quot;))

log.info(&quot;REQMOD stress: &quot; + files.length + &quot; sample file(s) from &quot; + samplesFolder + &quot; -&gt; &quot; + listFile)
</stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="REQMOD Load" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${__P(reqmod_threads)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(reqmod_rampup)}</stringProp>
        <stringProp name="ThreadGroup.duration">${__P(reqmod_duration)}</stringProp>
        <longProp name="ThreadGroup.delay">0</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <PreciseThroughputTimer guiclass="TestBeanGUI" testclass="PreciseThroughputTimer" testname="Precise Throughput Timer (${__P(reqmod_target_rps)} req/s)" enabled="true">
          <intProp name="calcMode">2</intProp>
          <stringProp name="throughput">${__P(reqmod_target_rps)}</stringProp>
          <intProp name="throughputPeriod">1</intProp>
          <longProp name="randomSeed">0</longProp>
          <stringProp name="duration">${__P(reqmod_duration)}</stringProp>
          <intProp name="batchSize">1</intProp>
          <intProp name="batchThreadDelay">0</intProp>
          <doubleProp>
            <name>allowedThroughputSurplus</name>
            <value>1.0</value>
            <savedValue>0.0</savedValue>
          </doubleProp>
          <intProp name="exactLimit">10000</intProp>
        </PreciseThroughputTimer>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Sample files (round-robin)" enabled="true">
          <stringProp name="filename">${__P(reqmod_file_list)}</stringProp>
          <stringProp name="variableNames">FILE_PATH</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Alternate POST/PUT per thread" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">vars.put(&quot;METHOD&quot;, (ctx.getThreadNum() % 2 == 0) ? &quot;POST&quot; : &quot;PUT&quot;)</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="REQMOD upload ${FILE_PATH}" enabled="true">
          <intProp name="HTTPSampler.connect_timeout">5000</intProp>
          <intProp name="HTTPSampler.response_timeout">180000</intProp>
          <stringProp name="HTTPSampler.domain">${__P(reqmod_host)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(reqmod_port)}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">${__P(reqmod_path)}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">${METHOD}</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <elementProp name="HTTPsampler.Files" elementType="HTTPFileArgs">
            <collectionProp name="HTTPFileArgs.files">
              <elementProp name="${FILE_PATH}" elementType="HTTPFileArg">
                <stringProp name="File.path">${FILE_PATH}</stringProp>
                <stringProp name="File.mimetype">application/octet-stream</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="200 (allowed) and 403 (blocked) are both valid REQMOD verdicts" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">
def code = prev.getResponseCode()
prev.setSuccessful(code == &quot;200&quot; || code == &quot;403&quot;)
</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="REQMOD Results (CSV)" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${__P(reqmod_results_file)}</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>